tap "homebrew/cask"
tap "homebrew/cask-fonts"
cask_args appdir: "~/Applications"

brew "anyenv"
brew "awscli"
brew "aws-sam-cli"
brew "brew-cask-completion"
brew "ctags"
brew "firebase-cli"
brew "grep"
brew "neovim"
brew "mas"
brew "mysql"
brew "starship"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "zsh-completions"
# brew "gh"
# brew "jq"
# brew "nkf"
# brew "ffmpeg"
# brew "flutter"
# brew "tfenv"

# ブラウザ
cask "google-chrome"
# cask "firefox"

# 開発系
cask "clipy"
cask "docker"
cask "iterm2"
cask "visual-studio-code"
cask "karabiner-elements"
# cask "android-studio"
# cask "aws-vault"
# cask "altair-graphql-client"
# cask "flutter"
# cask "mysqlworkbench"
# cask "notion"
cask "nosql-workbench"


# その他
# cask "amazon-music"
cask "font-fira-code-nerd-font"


# AppStore
# mas "Slack", id: 803453959
# mas "1Password", id: 443987910
