tap "homebrew/cask-fonts"
cask_args appdir: "~/Applications"

brew "awscli"
# brew "aws-sam-cli"
brew "bat"
brew "brew-cask-completion"
brew "btop"
brew "ctags"
brew "ctop"
brew "git-delta"
brew "eza"
brew "ffmpeg"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "graphviz"
brew "grep"
brew "jq"
brew "neovim"
# brew "nkf"
brew "mise"
brew "mas"
brew "mysql"
brew "sheldon"
brew "starship"
brew "tree"
brew "wget"

# neovimのプラグインで利用
brew "ripgrep"
brew "fd"
brew "pngpaste"

# ブラウザ
cask "google-chrome"

# 開発系
cask "altair-graphql-client"
# cask "android-studio"
# cask "aws-vault"
cask "cleanshot"
cask "chatgpt"
cask "cursor"
cask "discord"
cask "slack"
cask "docker"
# cask "flutter"
cask "figma"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
# cask "mysqlworkbench"
cask "nosql-workbench"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"

# その他
cask "font-fira-code-nerd-font"
